chang01234/test1/DICMFramework/sdkconfig/5.x/sdkconfig.defaults.pm.esp32s3
# target
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_IDF_TARGET="esp32s3"

#
# Security features
#
CONFIG_SECURE_BOOT_SIGNING_KEY="DICMFramework/secure_boot_signing_key_rsa.pem"
# end of Security features

CONFIG_RTC_CLK_SRC_INT_8MD256=y
CONFIG_RTC_CLK_CAL_CYCLES=3000

# ESP32S3-Specific
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# External ram
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=n
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=128
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_MEMTEST=y


# PHY
CONFIG_ESP_PHY_ENABLE_USB=n

# BLE
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=9
CONFIG_BT_CTRL_BLE_MAX_ACT=9
CONFIG_BT_NIMBLE_HS_FLOW_CTRL=y

# MODEM SLEEP Options
CONFIG_BT_CTRL_MODEM_SLEEP=y

# WiFi
CONFIG_ESP_WIFI_IRAM_OPT=n